app/views/schedules/_h_overview.html.erb

  <tr>
    <td class="user-name"><%= User.first_name user%> <br> <%= User.last_name user %></td>
---
SELECT "users".* FROM "users"  ORDER BY "users"."name" ASC