app/controllers/schedules_controller.rb

SELECT  "schedules".* FROM "schedules" WHERE "schedules"."user_id" = ? AND "schedules"."start_date" = ?  ORDER BY "schedules"."id" ASC LIMIT 1  [["user_id", "1"], ["start_date", "2019-12-02"]]
---
  def index
    if params[:schedule_start_date].nil?
      @this_monday = Date.today.monday.to_datetime
    else
      @this_monday = DateTime.parse(params[:schedule_start_date])
    end
    if !@user.nil?
      @schedule = Schedule.where(user_id: @user.id).where(start_date: @this_monday).first

SELECT "schedules".* FROM "schedules" WHERE "schedules"."start_date" = ?  [["start_date", "2019-11-29 00:00:00.000000"]]
INSERT INTO "schedules" ("user_id", "fri_times", "start_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", "1"], ["fri_times", "[\"0900\"]"], ["start_date", "2019-11-25"], ["created_at", "2019-11-18 22:51:40.239173"], ["updated_at", "2019-11-18 22:51:40.239173"]]
---
  def create
    @schedule = Schedule.new(schedule_params)

    if Schedule.start_date_exists? @schedule
      sched = Schedule.find_by_start_date @schedule
      redirect_to edit_user_schedule_path(@user, sched), notice: 'A schedule with this start date already exists.'
    elsif !Schedule.is_monday? @schedule.start_date
      redirect_to new_user_schedule_path(@user), notice: 'The selected start date is not a Monday.'
    else
      respond_to do |format|
        if @schedule.save

UPDATE "schedules" SET "fri_var_times" = ?, "mon_times" = ?, "tue_times" = ?, "wed_times" = ?, "thu_times" = ?, "fri_times" = ?, "updated_at" = ? WHERE "schedules"."id" = ?  [["fri_var_times", "[\"0900\"]"], ["mon_times", "[]"], ["tue_times", "[]"], ["wed_times", "[]"], ["thu_times", "[]"], ["fri_times", "[]"], ["updated_at", "2019-11-18 22:51:58.469469"], ["id", 5]]
---
  def update
    respond_to do |format|

      this_schedule_params = schedule_params()

      for day in ["mon", "tue", "wed", "thu", "fri"]
        if this_schedule_params[day + "_times"].nil?
          this_schedule_params[day + "_times"] = []
        end
        if this_schedule_params[day + "_var_times"].nil?
          this_schedule_params[day + "_var_times"] = []
        end
      end

      if @schedule.update(this_schedule_params)

DELETE FROM "schedules" WHERE "schedules"."id" = ?  [["id", 1]]
---
  def destroy
    @schedule.destroy

SELECT  "schedules".* FROM "schedules"  ORDER BY "schedules"."id" ASC LIMIT 1
SELECT "users".* FROM "users"  ORDER BY "users"."name" ASC
---
  def overview
    if params[:schedule_start_date].nil?
      @this_monday = Date.today.monday.to_datetime
    else
      @this_monday = DateTime.parse(params[:schedule_start_date])
    end
    @schedules = Schedule.all
    @users = User.get_non_admins.order(:name)

SELECT  "schedules".* FROM "schedules" WHERE "schedules"."id" = ? LIMIT 1  [["id", 11]]
---
    def set_schedule
      @schedule = Schedule.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_user
      if !params[:user_id].nil?
        @user = User.find(params[:user_id])