app/controllers/users_controller.rb

UPDATE "users" SET "admin" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["admin", "f"], ["updated_at", "2019-12-06 05:30:33.215966"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)